{
  "section": "700",
  "text": "Additional Rules",
  "children": [
    {
      "section": "701",
      "text": "Buffs",
      "children": []
    },
    {
      "section": "702",
      "text": "Buffs are objects placed on Units.",
      "children": [
        {
          "section": "702.1",
          "text": "Buffs can be tracked with a buff reminder card from a Riftbound booster pack or with any spare object in your surroundings.",
          "children": []
        },
        {
          "section": "702.2",
          "text": "Buffs can be added or spent.",
          "children": [
            {
              "section": "702.2.a",
              "text": "To Buff a Unit , a player chooses a Unit and then places a buff on it. That Unit is Buffed for as long as the buff remains on it.",
              "children": []
            },
            {
              "section": "702.2.b",
              "text": "Spending a Buff removes a single Buff counter from a Unit .",
              "children": [
                {
                  "section": "702.2.b.1",
                  "text": "A buff cannot be spent from a Unit that does not have a buff.",
                  "children": []
                },
                {
                  "section": "702.2.b.2",
                  "text": "A player can only spend buffs on units they control.",
                  "children": []
                }
              ]
            }
          ]
        },
        {
          "section": "702.3",
          "text": "There can only be one Buff on a Unit at a time.",
          "children": [
            {
              "section": "702.3.a",
              "text": "If a Buff is added, or instructed to be added, on a Unit that already has a Buff , it is not placed instead.",
              "children": []
            }
          ]
        }
      ]
    },
    {
      "section": "703",
      "text": "Each Buff individually contributes +1 Might to a Unit.",
      "children": []
    },
    {
      "section": "704",
      "text": "Buffs are Game Objects and may be referenced, counted, or targeted by other effects as speciﬁed.",
      "children": []
    },
    {
      "section": "705",
      "text": "If a Unit leaves play, remove all Buffs from it.",
      "children": [
        {
          "section": "705.1",
          "text": "Champions do not retain Buffs in the Champion Zone, even if they return there somehow.",
          "children": []
        }
      ]
    },
    {
      "section": "706",
      "text": "Mighty",
      "children": []
    },
    {
      "section": "707",
      "text": "Mighty is a description that applies to some units. Other game effects can check whether a unit is Mighty.",
      "children": []
    },
    {
      "section": "708",
      "text": "A Unit \"is Mighty\" as long as its Might is 5 or greater.",
      "children": []
    },
    {
      "section": "709",
      "text": "A Unit \"becomes Mighty\" at the moment its Might changes from being less than 5 to being 5 or greater. Example: A Unit with Might 4 that gets +1 [M] becomes Mighty . Example: A Unit with Might 5 that gets +1 [M] does not become Mighty , because it was already Mighty.",
      "children": []
    },
    {
      "section": "710",
      "text": "Units on the board are evaluated according to their current Might. Example: A unit with a base Might of 3 is targeted by a spell that reads \"A unit gets +3 [M] this turn.\" As that spell resolves, its Might changes from 3 to 6, and it becomes Mighty . When that effect expires at the end of the turn, it will no longer be Mighty.",
      "children": []
    },
    {
      "section": "711",
      "text": "Units in Non-Board Zones are evaluated according to their inherent Might. Example: A unit in the trash is Mighty if its printed Might is 5 or greater. It doesn't matter if there were effects raising or lowering its might while it was on the board.",
      "children": []
    },
    {
      "section": "712",
      "text": "Bonus Damage",
      "children": []
    },
    {
      "section": "713",
      "text": "Bonus Damage is an intrinsic property that can be granted to Deal actions that inﬂuence the amount of Damage that the action is distributing.",
      "children": []
    },
    {
      "section": "714",
      "text": "If more than one instance of Bonus Damage is applied or granted to a Deal action, all instances are summed and applied once.",
      "children": [
        {
          "section": "714.1",
          "text": "Bonus Damage can only be a positive value, and can only increase the amount of Damage being distributed.",
          "children": []
        },
        {
          "section": "714.2",
          "text": "If, for any reason, Bonus Damage would be a negative number, then no Bonus Damage is applied to the action.",
          "children": []
        }
      ]
    },
    {
      "section": "715",
      "text": "Bonus Damage applies to the total damage Dealt by one instance of the action.",
      "children": [
        {
          "section": "715.1",
          "text": "If the Deal action has a single target, the amount of Damage to that target will be increased by the Bonus Damage granted to it.",
          "children": []
        },
        {
          "section": "715.2",
          "text": "If the Deal action has multiple targets, the amount of Damage dealt to each target is increased by Bonus Damage individually and separately. Example: Singularity is a spell that says “Deal 6 to each of up to two units.” A player plays Singularity while they also control Annie, Fiery, a unit that says “Your spells and abilities deal 1 Bonus Damage.” Singularity deals 1 Bonus Damage to both of its targets, dealing 7 to each.",
          "children": []
        },
        {
          "section": "715.3",
          "text": "If the Deal action Splits damage, then the Bonus Damage applies to the amount of Damage that will be Split . This can alter the number of targets eligible to be chosen. Example: Volibear, Furious is a unit that says in part “When I attack, deal 5 damage split among any number of enemy units here.” A player attacks with Volibear, Furious while they also control Annie, Fiery, a unit that says “Your spells and abilities deal 1 Bonus Damage.” Volibear, Furious now deals 6 damage split among any number of enemy units at its location, and can choose to split that damage among up to 6 units rather than the usual 5.",
          "children": []
        }
      ]
    },
    {
      "section": "717",
      "text": "Attaching is a limited action that causes cards to become linked to each other to combine their effects in some way. This causes one card to become Attached and the other to become A Top-Most Card. See rule 421 Attach for more information.",
      "children": []
    },
    {
      "section": "718",
      "text": "Attached is the state of a card being linked to another card in this way.",
      "children": [
        {
          "section": "718.1",
          "text": "A card remains in this state until Detached.",
          "children": []
        },
        {
          "section": "718.2",
          "text": "While in this state, the card’s Rules Text is Inactive. See rule 720 Inactive for more information.",
          "children": []
        },
        {
          "section": "718.3",
          "text": "While in this state, Abilities in the card’s Effect Text are appended to the Rules Text of the Top-Most Card.",
          "children": []
        },
        {
          "section": "718.4",
          "text": "While in this state, the card’s Might Bonus modulates the Top-Most Card ’s Might by the value listed.",
          "children": []
        },
        {
          "section": "718.5",
          "text": "Attached cards still have all properties of being a card on the board while in this state.",
          "children": [
            {
              "section": "718.5.a",
              "text": "Attached cards still have all Types and Tags while Attached.",
              "children": []
            },
            {
              "section": "718.5.b",
              "text": "Attached cards still can be chosen or targeted by game effects while Attached.",
              "children": []
            }
          ]
        },
        {
          "section": "718.6",
          "text": "Attached cards cannot be moved separately from the Top-Most Card they are Attached to.",
          "children": []
        },
        {
          "section": "718.7",
          "text": "A card may be Attached only to a single Top-Most card at a time.",
          "children": []
        },
        {
          "section": "718.8",
          "text": "Attached cards may have different Controllers from their Top-Most card.",
          "children": [
            {
              "section": "718.8.a",
              "text": "Changes in Control of the Top-Most card do not impact Control of Attached cards and vice versa.",
              "children": []
            },
            {
              "section": "718.8.b",
              "text": "An Attached card still appends the abilities in its Effect Text to the Rules Text of the Top-Most card and modulates the Top-Most Card ’s Might by its Might Bonus.",
              "children": []
            }
          ]
        }
      ]
    },
    {
      "section": "719",
      "text": "A Top-Most Card is a card that has one or more cards linked to it through the process of Attaching.",
      "children": [
        {
          "section": "719.1",
          "text": "The Effect Text of all cards Attached to this card are appended to the Rules Text of this card for as long as they remain Attached.",
          "children": []
        },
        {
          "section": "719.2",
          "text": "This card ceases being a Top-Most Card when there are no longer any cards Attached to it.",
          "children": []
        },
        {
          "section": "719.3",
          "text": "A Top-Most Card and all cards Attached to it are at the same location.",
          "children": [
            {
              "section": "719.3.a",
              "text": "When the Top-Most Card moves, all Attached cards move with it.",
              "children": []
            }
          ]
        },
        {
          "section": "719.4",
          "text": "The Exhausted and Ready state of the Top-Most card does not affect nor change the status of the Attached cards and vice versa.",
          "children": []
        },
        {
          "section": "719.5",
          "text": "When a Top-Most Card changes zones from a board zone to a non-board zone, all Attached cards Detach from it, remaining in their current zones.",
          "children": [
            {
              "section": "719.5.a",
              "text": "The player that controls the Top-Most Card that changed zones decides the order these cards Detach in, and thus the order of any relevant effects that occur due to the Detach occurring.",
              "children": []
            }
          ]
        }
      ]
    },
    {
      "section": "720",
      "text": "Inactive",
      "children": []
    },
    {
      "section": "722",
      "text": "Inactive text is still present on cards.",
      "children": [
        {
          "section": "722.1",
          "text": "Cards with Inactive text still have keywords for the sake of Game Effects that want to reference or see if a card has a keyword.",
          "children": []
        },
        {
          "section": "722.2",
          "text": "Game Effects that parse or interpret text to determine target eligibility may still parse Inactive text for the sake of eligibility. Example: Spinning Axe is a gear with [Temporary]. While it’s attached and its rules text is inactive, its [Temporary] ability doesn’t trigger. However, a spell that reads “Destroy a gear with [Temporary]” could still choose and destroy Spinning Axe.",
          "children": []
        }
      ]
    },
    {
      "section": "723",
      "text": "Rules Text is never Inactive by default.",
      "children": []
    },
    {
      "section": "724",
      "text": "Effect Text is Inactive unless the card with the Effect Text is Attached.",
      "children": []
    },
    {
      "section": "725",
      "text": "Inactive text can partially cease to be Inactive under speciﬁc circumstances and exceptions.",
      "children": [
        {
          "section": "725.1",
          "text": "If an Attached card has a Passive or Replacement ability that applies during the process of Attaching or a Triggered ability that triggers off of Attaching , that text exists and can be processed as it Attaches.",
          "children": []
        },
        {
          "section": "725.2",
          "text": "If an Attached card has a Passive or Replacement ability that applies during the process of Detaching or a Triggered ability that triggers off of Detaching , that text exists and can be processed as it Detaches.",
          "children": []
        },
        {
          "section": "725.3",
          "text": "If an Attached card has an Equip ability, the Weaponmaster keyword can reference that Equip ability and any abilities that passively modify that Equip ability.",
          "children": []
        }
      ]
    },
    {
      "section": "726",
      "text": "Keywords",
      "children": []
    },
    {
      "section": "727",
      "text": "A Keyword is a speciﬁc term that appears on Cards that acts as a shorthand for a speciﬁc game effect, or ability of any variety.",
      "children": [
        {
          "section": "727.1",
          "text": "A Keyword can be an ability.",
          "children": []
        },
        {
          "section": "727.2",
          "text": "Keywords can be identiﬁed by having a colored highlight behind them.",
          "children": [
            {
              "section": "727.2.a",
              "text": "The color of the highlight has no effect on gameplay.",
              "children": []
            }
          ]
        },
        {
          "section": "727.3",
          "text": "Keywords can be referenced or speciﬁed by other Game Effects.",
          "children": [
            {
              "section": "727.3.a",
              "text": "Other effects may grant Keywords.",
              "children": [
                {
                  "section": "727.3.a.1",
                  "text": "The deﬁnition and rules of the speciﬁc Keyword will determine the behavior if a Keyword is granted while it is already present.",
                  "children": []
                },
                {
                  "section": "727.3.a.2",
                  "text": "The effect that granted the Keyword will specify the duration for which it is granted.",
                  "children": []
                },
                {
                  "section": "727.3.a.3",
                  "text": "If an effect that grants a Keyword does not specify a duration, the duration is as long as that Game Object remains on the Board or in its current Non-Board Zone.",
                  "children": []
                }
              ]
            },
            {
              "section": "727.3.b",
              "text": "Other effects may remove Keywords.",
              "children": [
                {
                  "section": "727.3.b.1",
                  "text": "The effect that removed the Keyword will specify the duration it is removed.",
                  "children": []
                },
                {
                  "section": "727.3.b.2",
                  "text": "If an effect that removes a Keyword does not specify a duration, the duration is as long as that Game Object remains on the Board or in its current Non-Board Zone.",
                  "children": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "section": "728",
      "text": "A card can have any number of Keywords.",
      "children": []
    },
    {
      "section": "729",
      "text": "Similar to other rules text, execute any effects of Keywords in the order listed when reading the card from top to bottom of the rules text.",
      "children": []
    },
    {
      "section": "730",
      "text": "Keyword Glossary",
      "children": []
    },
    {
      "section": "731",
      "text": "Accelerate",
      "children": [
        {
          "section": "731.1",
          "text": "Accelerate is a Unit ability.",
          "children": [
            {
              "section": "731.1.a",
              "text": "Accelerate is functionally short for \"As you play me, you may pay [1] and 1 Power as an additional cost. If you do, I enter ready.\"",
              "children": [
                {
                  "section": "731.1.a.1",
                  "text": "If the unit has a single domain, the Power portion of the Accelerate cost can be paid only with a Power that matches the domain of the unit.",
                  "children": []
                },
                {
                  "section": "731.1.a.2",
                  "text": "If the unit has no domain or more than one domain, the Power portion of the Accelerate cost can be paid with [A] (a Power of any domain).",
                  "children": []
                }
              ]
            }
          ]
        },
        {
          "section": "731.2",
          "text": "Accelerate is an Optional Additional Cost to be paid as a player plays the unit with the ability.",
          "children": [
            {
              "section": "731.2.a",
              "text": "Accelerate costs cannot be paid while the unit is on the board, only as part of the steps of playing a card.",
              "children": []
            }
          ]
        },
        {
          "section": "731.3",
          "text": "Accelerate has no function while on the board.",
          "children": []
        },
        {
          "section": "731.4",
          "text": "Multiple instances of Accelerate are redundant.",
          "children": []
        },
        {
          "section": "731.5",
          "text": "Accelerate, and whether or not a unit has Accelerate, is a characteristic of the Unit and may be checked or referenced by other Game Effects.",
          "children": []
        },
        {
          "section": "731.6",
          "text": "Accelerate inﬂuences the state of the unit entering the Board. It does not enter exhausted and then become ready.",
          "children": [
            {
              "section": "731.6.a",
              "text": "Accelerate will not interact with, or trigger, abilities that are affected by units becoming ready.",
              "children": []
            }
          ]
        }
      ]
    },
    {
      "section": "732",
      "text": "Action",
      "children": [
        {
          "section": "732.1",
          "text": "Action is a Permissive keyword.",
          "children": [
            {
              "section": "732.1.a",
              "text": "It can be present on Spells , Units , Rune Abilities, Legend Abilities or Permanent Abilities.",
              "children": []
            },
            {
              "section": "732.1.b",
              "text": "Action grants the corresponding card or effect permission to be played or activated during Showdowns, even when it is not the Controlling player's turn.",
              "children": []
            },
            {
              "section": "732.1.c",
              "text": "Action is functionally short for the following:",
              "children": [
                {
                  "section": "732.1.c.1",
                  "text": "On Spells and Units: \"This can be played during showdowns on any player's turn.\"",
                  "children": []
                },
                {
                  "section": "732.1.c.2",
                  "text": "On Rune, Legend, or Permanent Abilities: \"This can be activated during showdowns on any player's turn.\"",
                  "children": []
                }
              ]
            }
          ]
        },
        {
          "section": "732.2",
          "text": "The card or effect with this keyword is not restricted to showdowns. This permission is inclusive of all other timings and options available to the ability as written or by default.",
          "children": []
        },
        {
          "section": "732.3",
          "text": "Action does not alter the function of any instruction of the corresponding card or effect it is on. It is only permission. Example: Playing a Unit with Action still has the inherent restrictions of playing Units without Action. It can only be played to the controlling player's base or a battleﬁeld they control.",
          "children": []
        },
        {
          "section": "732.4",
          "text": "Action is a referenceable characteristic.",
          "children": [
            {
              "section": "732.4.a",
              "text": "Whether or not a Game Object has Action is a characteristic of that Game Object and may be checked or referenced by other Game Effects.",
              "children": []
            },
            {
              "section": "732.4.b",
              "text": "Whether or not a Spell has Action is a characteristic of that Spell and may be checked or referenced by other Game Effects.",
              "children": []
            },
            {
              "section": "732.4.c",
              "text": "Whether or not an Ability has Action is a characteristic of that Ability and may be checked or referenced by other Game Effects.",
              "children": []
            }
          ]
        }
      ]
    },
    {
      "section": "733",
      "text": "Assault",
      "children": [
        {
          "section": "733.1",
          "text": "Assault is a Passive Ability keyword.",
          "children": [
            {
              "section": "733.1.a",
              "text": "It is present on Units.",
              "children": []
            },
            {
              "section": "733.1.b",
              "text": "Assault is formatted as \"Assault [X]\".",
              "children": [
                {
                  "section": "733.1.b.1",
                  "text": "The X is referenced in the functional text of the ability.",
                  "children": []
                },
                {
                  "section": "733.1.b.2",
                  "text": "The X is referred to as the Assault Value.",
                  "children": []
                },
                {
                  "section": "733.1.b.3",
                  "text": "If X is omitted, it is presumed to be 1.",
                  "children": []
                }
              ]
            },
            {
              "section": "733.1.c",
              "text": "It is functionally short for \"While I am an attacker, I have +X [M].\"",
              "children": []
            },
            {
              "section": "733.1.d",
              "text": "Being an attacker means the Unit has gained the Attacker designation during Combat. See rule 437. Combat for more information.",
              "children": [
                {
                  "section": "733.1.d.1",
                  "text": "Assault remains in effect as long as the Unit maintains the Attacker designation.",
                  "children": []
                }
              ]
            }
          ]
        },
        {
          "section": "733.2",
          "text": "If a Unit has Assault or has been granted Assault and is granted Assault by an additional source, the Assault Value of all granted Assault keywords is summed. Example: Petty Ofﬁcer has Assault. It is chosen as the target of Cleave, which says \"Give a unit [Assault 3] this turn.\" After Cleave resolves, Petty Ofﬁcer has Assault 4 this turn.",
          "children": []
        },
        {
          "section": "733.3",
          "text": "Assault, and whether or not a unit has Assault, is a characteristic of the Unit and may be checked or referenced by other Game Effects.",
          "children": []
        }
      ]
    },
    {
      "section": "734",
      "text": "Deathknell",
      "children": [
        {
          "section": "734.1",
          "text": "Deathknell is a Triggered Ability keyword.",
          "children": [
            {
              "section": "734.1.a",
              "text": "It is present on Permanents.",
              "children": []
            },
            {
              "section": "734.1.b",
              "text": "It is formatted as \"Deathknell — [Effect]\".",
              "children": [
                {
                  "section": "734.1.b.1",
                  "text": "[Effect] is the rules text for the speciﬁc instance of Deathknell. This is referred to as the Deathknell effect.",
                  "children": []
                }
              ]
            },
            {
              "section": "734.1.c",
              "text": "It is functionally short for \"When I die, [Effect].\"",
              "children": [
                {
                  "section": "734.1.c.1",
                  "text": "[Effect] is the rules text of the Deathknell effect.",
                  "children": []
                }
              ]
            },
            {
              "section": "734.1.d",
              "text": "The Trigger for this effect is the Permanent being Killed and sent to the Trash.",
              "children": [
                {
                  "section": "734.1.d.1",
                  "text": "If the Permanent with the effect is not sent to the Trash , for example because its \"killed\" event was replaced with a recall, the Deathknell will not occur.",
                  "children": []
                },
                {
                  "section": "734.1.d.2",
                  "text": "The trigger will be added to the chain as a Pending Item before the card with Deathknell is moved to the trash due to a Kill instruction or a Cleanup.",
                  "children": []
                },
                {
                  "section": "734.1.d.3",
                  "text": "Before the card with Deathknell is moved to the Trash , note its location, its attributes, and any other details related to the effect of its Deathknell to process the trigger after it has been Finalized .",
                  "children": []
                }
              ]
            }
          ]
        },
        {
          "section": "734.2",
          "text": "Each instance of Deathknell a Permanent may have will trigger separately.",
          "children": [
            {
              "section": "734.2.a",
              "text": "The controller will choose the order to add these Triggers to the chain.",
              "children": []
            }
          ]
        },
        {
          "section": "734.3",
          "text": "Deathknell, and whether or not a permanent has Deathknell, is a characteristic of the permanent and may be checked or referenced by other Game Effects.",
          "children": []
        }
      ]
    },
    {
      "section": "735",
      "text": "Deﬂect",
      "children": [
        {
          "section": "735.1",
          "text": "Deﬂect is a Passive Ability keyword.",
          "children": [
            {
              "section": "735.1.a",
              "text": "It is present on Permanents.",
              "children": []
            },
            {
              "section": "735.1.b",
              "text": "It is formatted as \"Deﬂect [X]\".",
              "children": [
                {
                  "section": "735.1.b.1",
                  "text": "The X is referenced in the functional text of the ability.",
                  "children": []
                },
                {
                  "section": "735.1.b.2",
                  "text": "The X is referred to as the Deﬂect Value.",
                  "children": []
                },
                {
                  "section": "735.1.b.3",
                  "text": "If X is omitted, it is presumed to be 1.",
                  "children": []
                }
              ]
            },
            {
              "section": "735.1.c",
              "text": "It is functionally short for \"Spells and abilities an opponent controls that choose me cost an amount of Power equal to [Deﬂect Value] more to play as an additional cost.\"",
              "children": [
                {
                  "section": "735.1.c.1",
                  "text": "The Power used to pay this cost may always be of any Domain. Example: A Fury spell targets an Order unit with Deﬂect. The Power used to pay the Deﬂect cost can be any Domain; it does not need to match the Domain of the spell or the target.",
                  "children": []
                }
              ]
            },
            {
              "section": "735.1.d",
              "text": "It is an effect that imposes a Mandatory Additional Cost on Spells and Abilities that choose the permanent that has this ability. See rule 346. Playing Cards for more information.",
              "children": []
            }
          ]
        },
        {
          "section": "735.2",
          "text": "If a Unit has Deﬂect, or has been granted Deﬂect, and is granted Deﬂect by an additional source, the Deﬂect Value of all granted Deﬂect keywords is summed.",
          "children": []
        },
        {
          "section": "735.3",
          "text": "Deﬂect, and whether or not a permanent has Deﬂect, is a characteristic of the permanent and may be checked or referenced by other Game Effects.",
          "children": []
        }
      ]
    },
    {
      "section": "736",
      "text": "Ganking",
      "children": [
        {
          "section": "736.1",
          "text": "Ganking is a Passive Ability keyword.",
          "children": [
            {
              "section": "736.1.a",
              "text": "It is present on Units.",
              "children": []
            },
            {
              "section": "736.1.b",
              "text": "It is functionally short for \"I may move to a battleﬁeld from another battleﬁeld.\"",
              "children": []
            },
            {
              "section": "736.1.c",
              "text": "It is a passive ability that adds permissions to the Unit's Standard Move.",
              "children": [
                {
                  "section": "736.1.c.1",
                  "text": "It does not restrict or remove options from the Unit's Standard Move.",
                  "children": []
                },
                {
                  "section": "736.1.c.2",
                  "text": "It does not have an activation cost.",
                  "children": []
                },
                {
                  "section": "736.1.c.3",
                  "text": "It does not give additional abilities or activations of Movement, only new options for the Standard Move.",
                  "children": []
                }
              ]
            }
          ]
        },
        {
          "section": "736.2",
          "text": "Multiple instances of Ganking are redundant.",
          "children": []
        },
        {
          "section": "736.3",
          "text": "Ganking, and whether or not a unit has Ganking, is a characteristic of the Unit and may be checked or referenced by other Game Effects.",
          "children": []
        }
      ]
    },
    {
      "section": "737",
      "text": "Hidden",
      "children": [
        {
          "section": "737.1",
          "text": "Hidden is a keyword that acts as a prerequisite to perform the Hide Discretionary Action.",
          "children": [
            {
              "section": "737.1.a",
              "text": "It is present on Spells, Units, and Gear.",
              "children": []
            },
            {
              "section": "737.1.b",
              "text": "It is functionally short for \"While this card is in your hand or in the Champion Zone on your turn during an Open State, you may pay [A] to hide this facedown at a battleﬁeld you control that doesn't already have a facedown card hidden there for as long as you control that battleﬁeld. Beginning on the next turn, this gains [Reaction] and you may play this, ignoring its base cost.\"",
              "children": []
            },
            {
              "section": "737.1.c",
              "text": "It allows the player to take the Discretionary Action Hide .",
              "children": [
                {
                  "section": "737.1.c.1",
                  "text": "Hide is not a subset of Play .",
                  "children": []
                },
                {
                  "section": "737.1.c.2",
                  "text": "Hiding a card does not open a chain.",
                  "children": []
                },
                {
                  "section": "737.1.c.3",
                  "text": "Playing a card from facedown (or \"from Hidden\") does open a chain.",
                  "children": []
                }
              ]
            },
            {
              "section": "737.1.d",
              "text": "Some choices made while playing a card from Hidden are restricted to the battleﬁeld where it was hidden. A card cannot be played from Hidden if it is a spell with no valid targets under these restrictions. See_rule_REF_352.5_DOT Targeting for more information.",
              "children": [
                {
                  "section": "737.1.d.1",
                  "text": "A hidden unit must be played to that battleﬁeld.",
                  "children": []
                },
                {
                  "section": "737.1.d.2",
                  "text": "If a hidden spell or a play effect of a hidden permanent chooses any targets, those targets must be chosen from among options at that battleﬁeld, unless the ability explicitly restricts targeting in a way that makes this impossible. Example: Blastcone Fae is a unit with Hidden and “When you play me, give a unit -2 [M] this turn, to a minimum of 1 [M].” Because this is a play effect, its target must be chosen from among units at the same battleﬁeld if Blastcone Fae was played from Hidden. Example: Tideturner is a unit with Hidden and “When you play me, you may choose a unit you control at another location. Move me to its location and it to my original location.” Because its play ability has a targeting restriction that can never be fulﬁlled by a unit at its battleﬁeld, its target may be chosen freely from among the available options.",
                  "children": []
                },
                {
                  "section": "737.1.d.3",
                  "text": "If a hidden spell or a play effect of a hidden permanent causes you to play a unit, you must choose to play that unit at that battleﬁeld.",
                  "children": []
                }
              ]
            }
          ]
        },
        {
          "section": "737.2",
          "text": "Abilities and instructions of hidden cards other than the choices listed above function as normal. Example: Stand United is a spell that has Hidden and says “Buff a friendly unit. Buffs give an additional +1 might to friendly units this turn.” If it’s played from Hidden, the ﬁrst part of its ability must choose a friendly unit at the same battleﬁeld, but the second part of its ability affects all friendly units with buffs, no matter where they are.",
          "children": []
        },
        {
          "section": "737.3",
          "text": "Instead of being hidden, a card with Hidden may be played for its cost as normal, at its normal timing with no restrictions on targeting.",
          "children": []
        },
        {
          "section": "737.4",
          "text": "Multiple instances of Hidden are redundant.",
          "children": []
        },
        {
          "section": "737.5",
          "text": "Hidden, and whether or not a card has Hidden, is a characteristic of the card and may be checked or referenced by other Game Effects.",
          "children": [
            {
              "section": "737.5.a",
              "text": "This is independent of the state of being facedown.",
              "children": []
            }
          ]
        },
        {
          "section": "737.6",
          "text": "A card that is Hidden gains Reaction while facedown, and may be played any time a card with Reaction may be played as a result.",
          "children": [
            {
              "section": "737.6.a",
              "text": "The property is granted to the card in its facedown state, and is not publicly known.",
              "children": []
            }
          ]
        }
      ]
    },
    {
      "section": "738",
      "text": "Legion",
      "children": [
        {
          "section": "738.1",
          "text": "Legion is a Conditional Keyword.",
          "children": [
            {
              "section": "738.1.a",
              "text": "It can be present on Spells, Units, Rune Abilities, Legend Abilities and Permanent Abilities.",
              "children": []
            },
            {
              "section": "738.1.b",
              "text": "It is formatted as \"Legion — [Text]\".",
              "children": []
            },
            {
              "section": "738.1.c",
              "text": "Starting from the Keyword to the end of the clause, the entire statement is the Legion Ability.",
              "children": [
                {
                  "section": "738.1.c.1",
                  "text": "On spells and on play effects of permanents, it is functionally short for “If you have played another Main Deck card before this one already this turn, apply [Text].”",
                  "children": []
                },
                {
                  "section": "738.1.c.2",
                  "text": "On other abilities and instructions, it is functionally short for “If you have played a Main Deck card this turn, apply [Text].”",
                  "children": []
                },
                {
                  "section": "738.1.c.3",
                  "text": "This is called the Legion condition.",
                  "children": []
                },
                {
                  "section": "738.1.c.4",
                  "text": "Legion's conditional can apply to passive abilities, activated abilities, spell instructions, or even abilities active in zones outside of the board.",
                  "children": []
                }
              ]
            }
          ]
        },
        {
          "section": "738.2",
          "text": "All instances of Legion on cards a player controls are satisﬁed by that player playing a single card. Example: One card has three different Legion Abilities. The Legion Text of all three abilities apply as long as one card has been played by the card's controller earlier in the same turn.",
          "children": []
        },
        {
          "section": "738.3",
          "text": "Legion, and whether or not a card has Legion, is a characteristic of the card and may be checked or referenced by other Game Effects.",
          "children": []
        }
      ]
    },
    {
      "section": "739",
      "text": "Reaction",
      "children": [
        {
          "section": "739.1",
          "text": "Reaction is a Permissive keyword.",
          "children": [
            {
              "section": "739.1.a",
              "text": "It can be present on Spells, Units, Rune Abilities, Legend Abilities and Permanent Abilities.",
              "children": []
            },
            {
              "section": "739.1.b",
              "text": "Reaction grants the corresponding card or effect all abilities and permissions of Action.",
              "children": []
            },
            {
              "section": "739.1.c",
              "text": "Reaction , additionally, is functionally short for the following:",
              "children": [
                {
                  "section": "739.1.c.1",
                  "text": "On Spells: \"This can be played during Closed States on any player's turn.\"",
                  "children": []
                },
                {
                  "section": "739.1.c.2",
                  "text": "On Units: \"This can be played during Closed States on any player's turn.\"",
                  "children": []
                },
                {
                  "section": "739.1.c.3",
                  "text": "On Rune, Legend, or Permanent Abilities: \"This can be activated during Closed States on any player's turn.\"",
                  "children": []
                }
              ]
            }
          ]
        },
        {
          "section": "739.2",
          "text": "The corresponding card or effect with this keyword is not restricted to Closed States or Showdowns . This permission is inclusive of all other timings and options available to the ability as written, Action's permissions, or by default.",
          "children": []
        },
        {
          "section": "739.3",
          "text": "Reaction does not alter the function of any instruction of the Card, Rune, or Effect it is on. It is only Permission.",
          "children": [
            {
              "section": "739.3.a",
              "text": "Playing Units with Reaction still has the inherent restrictions of playing Units without Reaction. It can only be played to the controlling player's base or a battleﬁeld they control.",
              "children": []
            }
          ]
        },
        {
          "section": "739.4",
          "text": "Reaction is a referencable characteristic.",
          "children": [
            {
              "section": "739.4.a",
              "text": "Whether or not a Game Object has Reaction is a characteristic of that Game Object and may be checked or referenced by other Game Effects.",
              "children": []
            },
            {
              "section": "739.4.b",
              "text": "Whether or not a Spell has Reaction is a characteristic of that Spell and may be checked or referenced by other Game Effects.",
              "children": []
            },
            {
              "section": "739.4.c",
              "text": "Whether or not an Ability has Reaction is a characteristic of that Ability and may be checked or referenced by other Game Effects.",
              "children": []
            }
          ]
        }
      ]
    },
    {
      "section": "740",
      "text": "Shield",
      "children": [
        {
          "section": "740.1",
          "text": "Shield is a Passive Ability keyword.",
          "children": [
            {
              "section": "740.1.a",
              "text": "It is present on Units.",
              "children": []
            },
            {
              "section": "740.1.b",
              "text": "Shield is formatted as \"Shield [X]\".",
              "children": [
                {
                  "section": "740.1.b.1",
                  "text": "The X is referenced in the functional text of the ability.",
                  "children": []
                },
                {
                  "section": "740.1.b.2",
                  "text": "The X is referred to as the Shield Value.",
                  "children": []
                },
                {
                  "section": "740.1.b.3",
                  "text": "If X is omitted, it is presumed to be 1.",
                  "children": []
                }
              ]
            },
            {
              "section": "740.1.c",
              "text": "It is functionally short for \"While I am a defender, I have +X [M].\"",
              "children": []
            },
            {
              "section": "740.1.d",
              "text": "Being a defender means the Unit has gained the Defender designation during Combat. See rule 437. Combat for more information.",
              "children": [
                {
                  "section": "740.1.d.1",
                  "text": "Shield remains in effect as long as the Unit maintains the Defender designation.",
                  "children": []
                }
              ]
            }
          ]
        },
        {
          "section": "740.2",
          "text": "If a Unit has Shield, or has been granted Shield, and is granted Shield by an additional source, the Shield Value of all granted Shield keywords is summed. Example: Stalwart Poro has Shield. It is chosen as the target of Block, which says \"Give a unit [Shield 3] and [Tank] this turn.\" After Block resolves, Stalwart Poro has Shield 4 this turn.",
          "children": []
        },
        {
          "section": "740.3",
          "text": "Shield, and whether or not a unit has Shield, is a characteristic of the Unit and may be checked or referenced by other Game Effects.",
          "children": []
        }
      ]
    },
    {
      "section": "741",
      "text": "Tank",
      "children": [
        {
          "section": "741.1",
          "text": "Tank is a Passive Ability keyword.",
          "children": [
            {
              "section": "741.1.a",
              "text": "It is present on Units.",
              "children": []
            },
            {
              "section": "741.1.b",
              "text": "It is functionally short for \"I must be assigned lethal damage before any other unit with the same controller as me that does not have [Tank] during combat resolution.\"",
              "children": []
            },
            {
              "section": "741.1.c",
              "text": "It alters how players can elect to assign combat damage during combat.",
              "children": [
                {
                  "section": "741.1.c.1",
                  "text": "Players must still assign lethal damage to a unit before moving to the next when assigning their damage.",
                  "children": []
                },
                {
                  "section": "741.1.c.2",
                  "text": "If more than one unit with Tank is present with the same controller in Combat, damage may be assigned to any of them. Units without Tank are invalid assignments until all units with Tank have lethal damage assigned to them.",
                  "children": []
                }
              ]
            }
          ]
        },
        {
          "section": "741.2",
          "text": "Multiple instances of Tank are redundant.",
          "children": []
        },
        {
          "section": "741.3",
          "text": "Tank, and whether or not a unit has Tank, is a characteristic of the Unit and may be checked or referenced by other Game Effects.",
          "children": []
        }
      ]
    },
    {
      "section": "742",
      "text": "Temporary",
      "children": [
        {
          "section": "742.1",
          "text": "Temporary is a Triggered Ability keyword.",
          "children": [
            {
              "section": "742.1.a",
              "text": "It is present on Permanents.",
              "children": []
            },
            {
              "section": "742.1.b",
              "text": "It is functionally short for \"At the start of this permanent's controller's Beginning Phase, before scoring, kill this.\"",
              "children": []
            },
            {
              "section": "742.1.c",
              "text": "The Trigger Condition is the controller of the permanent's Beginning Phase occurring.",
              "children": []
            }
          ]
        },
        {
          "section": "742.2",
          "text": "Multiple instances of Temporary are redundant.",
          "children": []
        },
        {
          "section": "742.3",
          "text": "Temporary, and whether or not a permanent has Temporary, is a characteristic of the permanent and may be checked or referenced by other Game Effects.",
          "children": []
        }
      ]
    },
    {
      "section": "743",
      "text": "Vision",
      "children": [
        {
          "section": "743.1",
          "text": "Vision is a Triggered Ability keyword.",
          "children": [
            {
              "section": "743.1.a",
              "text": "It is present on Permanents.",
              "children": []
            },
            {
              "section": "743.1.b",
              "text": "It is functionally short for \"When this is played, look at the top card of your Main Deck. You may recycle it.\"",
              "children": []
            },
            {
              "section": "743.1.c",
              "text": "The trigger is the permanent entering the Board.",
              "children": []
            }
          ]
        },
        {
          "section": "743.2",
          "text": "Multiple instances of Vision trigger separately.",
          "children": [
            {
              "section": "743.2.a",
              "text": "The player may choose to recycle or not recycle for each instance of Vision separately.",
              "children": []
            },
            {
              "section": "743.2.b",
              "text": "If the player does not recycle the top card and nothing else happens in between the triggers resolving, each instance of Vision will see the same card.",
              "children": []
            }
          ]
        },
        {
          "section": "743.3",
          "text": "Vision, and whether or not a permanent has Vision, is a characteristic of the permanent and may be checked or referenced by other Game Effects.",
          "children": []
        }
      ]
    },
    {
      "section": "744",
      "text": "Equip",
      "children": [
        {
          "section": "744.1",
          "text": "Equip is an Activated Ability keyword.",
          "children": [
            {
              "section": "744.1.a",
              "text": "Equip is normally present on Gear with the tag Equipment.",
              "children": []
            },
            {
              "section": "744.1.b",
              "text": "Equip has a cost to activate and Attaches the card with Equip to a chosen Unit when the cost is paid.",
              "children": [
                {
                  "section": "744.1.b.1",
                  "text": "Equip’s choice is a Target.",
                  "children": []
                },
                {
                  "section": "744.1.b.2",
                  "text": "The chosen Unit will become the Top-Most Card for the Attach action.",
                  "children": []
                }
              ]
            },
            {
              "section": "744.1.c",
              "text": "Equip is formatted as “ Equip [Cost]”",
              "children": [
                {
                  "section": "744.1.c.1",
                  "text": "If paying costs or making choices for this ability causes triggered abilities to trigger, they will be placed on the chain above this ability in a Pending state. See rule 369 Activated Abilities for more information.",
                  "children": []
                },
                {
                  "section": "744.1.c.2",
                  "text": "Equip is functionally short for “[Cost]: Attach this gear to a unit you control.”",
                  "children": []
                },
                {
                  "section": "744.1.c.3",
                  "text": "Equip costs may include both resource costs and non-resource costs.",
                  "children": []
                },
                {
                  "section": "744.1.c.4",
                  "text": "Equip abilities may also include text that alters the Equip cost. Such text is taken into account when determining a card’s Equip cost for any reason.",
                  "children": []
                },
                {
                  "section": "744.1.c.5",
                  "text": "Equip abilities may include text that alters the timing or targeting of the Equip ability.",
                  "children": []
                }
              ]
            }
          ]
        },
        {
          "section": "744.2",
          "text": "When the Attach action completes from this keyword, the Unit that was chosen is considered to have been Equipped by the Gear with this ability.",
          "children": [
            {
              "section": "744.2.a",
              "text": "This is an event other Game Effects and Triggered Abilities can reference.",
              "children": []
            }
          ]
        },
        {
          "section": "744.3",
          "text": "Equipped is the state of a Top-Most Card being Attached by one or more cards that are Equipment.",
          "children": [
            {
              "section": "744.3.a",
              "text": "The state of being Equipped is synchronous with that of the Attached state of the Equipment.",
              "children": []
            },
            {
              "section": "744.3.b",
              "text": "A Top-Most Card is Equipped as long as one or more of its Attached cards are Equipment.",
              "children": []
            },
            {
              "section": "744.3.c",
              "text": "The state of being Equipped corresponds to a Top-Most card having a card with Equip that is Attached to it.",
              "children": []
            }
          ]
        },
        {
          "section": "744.4",
          "text": "Multiple instances of Equip are equivalent to multiple Activated Abilities and can each be activated separately by paying the corresponding costs.",
          "children": []
        },
        {
          "section": "744.5",
          "text": "Equip, and whether or not a Gear has Equip, is a characteristic of the Gear and may be checked or referenced by other Game Effects.",
          "children": []
        }
      ]
    },
    {
      "section": "745",
      "text": "Quick-Draw",
      "children": [
        {
          "section": "745.1",
          "text": "Quick-Draw is a Triggered Ability keyword. It is also a Permissive keyword.",
          "children": [
            {
              "section": "745.1.a",
              "text": "Quick-Draw is present on Gear with Equip abilities.",
              "children": []
            },
            {
              "section": "745.1.b",
              "text": "Cards with Quick-Draw have Reaction inherently.",
              "children": []
            },
            {
              "section": "745.1.c",
              "text": "Quick-Draw allows cards to be played and Attached using Reaction timing.",
              "children": []
            },
            {
              "section": "745.1.d",
              "text": "Quick-Draw is functionally short for “ [Reaction] ” and “When you play this, attach it to a Unit you control.” See rule 716 Attachment for more information.",
              "children": []
            }
          ]
        },
        {
          "section": "745.2",
          "text": "Multiple instances of Quick-Draw do not trigger separately and have no effect beyond the ﬁrst.",
          "children": []
        },
        {
          "section": "745.3",
          "text": "Quick-Draw has no function while on the board.",
          "children": []
        },
        {
          "section": "745.4",
          "text": "Quick-Draw , and whether or not a gear has Quick-Draw , is a characteristic of the Gear and may be checked or referenced by other Game Effects.",
          "children": []
        }
      ]
    },
    {
      "section": "746",
      "text": "Repeat",
      "children": [
        {
          "section": "746.1",
          "text": "Repeat is an Optional Additional Cost keyword.",
          "children": [
            {
              "section": "746.1.a",
              "text": "Repeat is present on Spells.",
              "children": []
            },
            {
              "section": "746.1.b",
              "text": "Repeat is an optional cost that player may pay to execute the effect of their spells a second time.",
              "children": []
            },
            {
              "section": "746.1.c",
              "text": "Repeat is formatted as “ Repeat [Cost]”",
              "children": [
                {
                  "section": "746.1.c.1",
                  "text": "The Cost is an Additional Cost to be paid during the steps of playing the spell.",
                  "children": []
                },
                {
                  "section": "746.1.c.2",
                  "text": "If a spell has more than one instance of Repeat , each Cost may be paid or not paid individually.",
                  "children": []
                },
                {
                  "section": "746.1.c.3",
                  "text": "Each Repeat Cost can be paid only a single time.",
                  "children": []
                }
              ]
            },
            {
              "section": "746.1.d",
              "text": "Repeat is functionally short for “You may pay [Cost] as an additional cost as you play this spell. If you do, execute the instructions of this spell one additional time.”",
              "children": [
                {
                  "section": "746.1.d.1",
                  "text": "When the additional cost is paid, the effect of the spell, upon resolution, will be performed an additional time. Example: Desert’s Call is a spell with [Repeat] [2] and “Play a 2 [S] Sand Soldier unit token.” If its controller pays its Repeat cost as they play it, the card’s instruction to play a Sand Soldier is executed twice, as though the card says “Play a 2 [S] Sand Soldier unit token. Play a 2 [S] Sand Soldier unit token.”",
                  "children": []
                }
              ]
            }
          ]
        },
        {
          "section": "746.2",
          "text": "When a spell’s effect is performed an additional time with Repeat , choices must be made at the usual time during the Make Relevant Choices step of Playing a Card. See rule 346 Playing Cards for more information.",
          "children": [
            {
              "section": "746.2.a",
              "text": "Choices made for the additional execution do not have to be the same as the choices made for the initial execution. Example: Rocket Barrage is a spell with [Repeat] [4][C] and “Choose one — Deal 4 to a unit in a base. [or] Kill a gear.” If Rocket Barrage’s controller pays its Repeat cost as they play it, they may choose the same mode or a different one, and if they choose the same mode, may choose the same target or a different one. If they choose “Kill a gear” twice and choose two different gear, they must specify which gear is the ﬁrst target and which is the second. As the spell resolves, those two gear will be killed in the chosen order.",
              "children": []
            }
          ]
        },
        {
          "section": "746.3",
          "text": "Multiple instances of Repeat can be paid for separately. The spell’s instructions will be executed an additional time for each instance of Repeat that is paid for.",
          "children": [
            {
              "section": "746.3.a",
              "text": "Regardless of the number of times a spell's instructions are executed with this keyword, the spell is only Played once.",
              "children": []
            }
          ]
        },
        {
          "section": "746.4",
          "text": "Repeat , and whether or not a spell has Repeat , is a characteristic of the Spell and may be checked or referenced by other Game Effects.",
          "children": []
        }
      ]
    },
    {
      "section": "747",
      "text": "Weaponmaster",
      "children": [
        {
          "section": "747.1",
          "text": "Weaponmaster is a Triggered Ability keyword.",
          "children": [
            {
              "section": "747.1.a",
              "text": "Weaponmaster is present on Units.",
              "children": []
            },
            {
              "section": "747.1.b",
              "text": "Weaponmaster is a Play Effect that chooses an Equipment you control and allows you to pay its Equip cost at a discount, regardless of the usual timing of the Equip ability, to Attach that Equipment to the unit with Weaponmaster.",
              "children": []
            },
            {
              "section": "747.1.c",
              "text": "Weaponmaster is functionally short for: “When you play me, choose a Card you control with the Equipment tag. Necessary portions of its Rules Text are no longer Inactive if they are currently Inactive. Pay the cost of its Equip ability, reduced by [A], to attach it to this unit.” See rule 716 Attachment for more information.",
              "children": [
                {
                  "section": "747.1.c.1",
                  "text": "Weaponmaster can choose an Equipment whether it has an Equip ability or not.",
                  "children": []
                },
                {
                  "section": "747.1.c.2",
                  "text": "The cost of the Equip ability is determined as though that Equip ability was being activated choosing the unit with the Weaponmaster ability, as modulated by any abilities that alter Equip costs.",
                  "children": []
                },
                {
                  "section": "747.1.c.3",
                  "text": "If the chosen card’s Equip cost does not contain [A], it can still be paid, but will not be reduced.",
                  "children": []
                },
                {
                  "section": "747.1.c.4",
                  "text": "If the chosen card doesn’t have an Equip cost, it can’t be paid.",
                  "children": []
                },
                {
                  "section": "747.1.c.5",
                  "text": "If the chosen card’s Equip cost can’t be paid, if it can’t be detached from its current Top-Most card, or if it can’t be attached to the unit with the Weaponmaster ability, it stays in its current location, Attached to anything it was already Attached to.",
                  "children": []
                },
                {
                  "section": "747.1.c.6",
                  "text": "The Equip ability is not activated this way, and the unit with the Weaponmaster ability is not chosen.",
                  "children": []
                }
              ]
            }
          ]
        },
        {
          "section": "747.2",
          "text": "Multiple instances of Weaponmaster trigger separately, and can choose different targets.",
          "children": [
            {
              "section": "747.2.a",
              "text": "If you choose the same target with multiple instances of Weaponmaster , each will resolve separately.",
              "children": []
            }
          ]
        },
        {
          "section": "747.3",
          "text": "Weaponmaster has no function while on the board.",
          "children": []
        },
        {
          "section": "747.4",
          "text": "Weaponmaster , and whether or not a unit has Weaponmaster , is a characteristic of the Unit and may be checked or referenced by other Game Effects.",
          "children": []
        }
      ]
    }
  ]
}